# THIS FILE IS AUTOMATICALLY GENERATED
# Project: H:\BCC722-RTOS-moinho\UCoS\Micrium_2\Software\EvalBoards\Cypress\CY8CKIT-050\PSoC\uCOS-III-Probe\ADC_SAR_Seq_Example01.cydsn\ADC_SAR_Seq_Example01.cyprj
# Date: Thu, 20 Oct 2022 11:44:21 GMT
#set_units -time ns
create_clock -name {Clock(routed)} -period 916.66666666666663 -waveform {0 458.333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 23 45} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for H:\BCC722-RTOS-moinho\UCoS\Micrium_2\Software\EvalBoards\Cypress\CY8CKIT-050\PSoC\uCOS-III-Probe\ADC_SAR_Seq_Example01.cydsn\TopDesign\TopDesign.cysch
# Project: H:\BCC722-RTOS-moinho\UCoS\Micrium_2\Software\EvalBoards\Cypress\CY8CKIT-050\PSoC\uCOS-III-Probe\ADC_SAR_Seq_Example01.cydsn\ADC_SAR_Seq_Example01.cyprj
# Date: Thu, 20 Oct 2022 11:44:10 GMT
